vegeta-cli/src/vegeta/aeromant/templates/rotor_mrf/org/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case (OpenFOAM.org dialect) — placeholder values are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          incompressibleFluid;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         {{ITERATIONS}};
deltaT          1;
writeControl    timeStep;
writeInterval   {{ITERATIONS}};
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;

functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        patches         ("body.*");
        rho             rhoInf;
        rhoInf          {{DENSITY}};
        CofR            ({{ROTOR_CENTER}});
    }
}

// ************************************************************************* //
