vegeta-cli/src/vegeta/aeromant/templates/rotor_mrf/org/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case (OpenFOAM.org dialect) — placeholder values are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 1;

method          scotch;

// ************************************************************************* //
